template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
        tolerance       1e-6;
        relTol          0.1;
    }
	
	Phi
    {
        $p;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
		nSweeps         2;
        tolerance       1e-6;
        relTol          0.1;
    }
}

potentialFlow
{
	nNonOrthogonalCorrectors  10;
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      		yes;

    residualControl
    {
        U                   1e-5;
        p                   1e-5;
        "(k|epsilon|omega)" 1e-4;
    }
    
    pRefCell 		0;
    pRefValue		0;
}

relaxationFactors
{
    equations
    {
		p					0.25;
        U                   0.5;
        "(k|omega|epsilon)" 0.5;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
